brew 'mas'
mas 'Annotate - Capture and Share', id: 918207447
mas 'Slack', id: 803453959
mas 'MindNode 5', id: 1289197285

cask 'google-chrome'
cask 'firefox'
cask 'virtualbox'
cask 'keepingyouawake'
cask 'yakyak'
cask 'iterm2'
cask 'sonos'
cask 'insomnia'

# dev
mas 'Kaleidoscope', id: 587512244
cask 'ksdiff'
tap 'neovim/neovim'
brew 'neovim'
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: %w[HEAD] # currently HEAD only
brew 'chruby'
brew 'ruby-install'
brew 'phantomjs'
brew 'chromedriver'
brew 'node'
brew 'yarn'
#brew 'multirust'
brew 'rust'
brew 'crystal-lang'
brew 'elixir'
brew 'leiningen'
cask 'aws-vault'

# data
brew 'postgres'
brew 'memcached'
brew 'redis'

# util
brew 'ag'
brew 'wget'
brew 'tree'
brew 'coreutils'
brew 'pv'
brew 'tmux'
brew 'htop'

# shells
brew 'zsh'
brew 'fish'

# misc
tap 'caskroom/fonts'
cask 'font-hack-nerd-font'
